api_server/app/controllers/blogs_controller.rb

  def index
    page = params[:page].nil? ? 0 : params[:page]
    @blogs = Blog.order('created_at desc').page(page)
---
SELECT  "blogs".* FROM "blogs" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 18], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "image", "user_id", "created_at", "updated_at", "tags") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "tag"], ["body", "へっぉ"], ["image", "20161213233745.jpg"], ["user_id", 1], ["created_at", 2016-12-13 14:37:45 UTC], ["updated_at", 2016-12-13 14:37:45 UTC], ["tags", "こんばんは,こんにちは"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "body" = ?, "image" = ?, "updated_at" = ? WHERE "blogs"."id" = ?

  def set_blog
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]